:PREAMBLE:
#+title: Epkgs: Misc
#+setupfile: .orgconfig
#+name: setup
#+begin_src emacs-lisp :results silent
  (require 'emir)
#+end_src
#+name: addheader
#+header: :var rows="" :var header=""
#+begin_src elisp :hlines yes :results none
  (epkg-add-org-header rows header)
#+end_src
[[https://emacsmirror.net/stats][up]]
:END:
* Highest version
:PROPERTIES:
:ID:       6f419005-fddc-4c3b-91af-08cefc08720b
:END:
#+name: highest-version
#+begin_src emacs-lisp :post addheader(*this*,'("" "#" "%"))
  (let ((zero 0)
        (one  0)
        (more 0)
        (odd  0)
        (none 0)
        (all  0))
    (dolist (pkg (epkgs nil [mirrored*]))
      (cl-incf all)
      (with-epkg-repository pkg
        (if-let ((tag (magit-git-string "tag" "--sort=-v:refname")))
            (if-let ((major (ignore-errors
                              (car (version-to-list
                                    (if (string-match "\\`[^0-9]*" tag)
                                        (substring tag (match-end 0))
                                      tag))))))
                (pcase major
                  (0 (cl-incf zero))
                  (1 (cl-incf one))
                  (_ (cl-incf more)))
              (message "%-20s %s" (oref pkg name) tag)
              (cl-incf odd))
          (cl-incf none))))
    (list (list 'zero  zero (/ (* 100 zero) all))
          (list 'one   one  (/ (* 100 one)  all))
          (list 'more  more (/ (* 100 more) all))
          (list 'odd   odd  (/ (* 100 odd)  all))
          (list 'none  none (/ (* 100 none) all))
          (list 'total all  (/ (* 100 all)  all))))
#+end_src
#+results: highest-version
| (6)   |    # |   % |
|-------+------+-----|
| zero  | 1441 |  24 |
| one   |  776 |  13 |
| more  |  448 |   7 |
| odd   |   30 |   0 |
| none  | 3152 |  53 |
| total | 5847 | 100 |
